%%
format longG
% 输入用户位置，WGS84
X=-2839327;
Y=4679324;
Z=3263596;%米为单位
USER_POS =[X Y Z];
%%
% 输入间隔64s的卫星位置，WGS84坐标系，单位米
RV1=[-2312189	4991636.5	4601948.5	-1798.678955	4439.653809	-5719.398926];
RV2 =[-2420842.75	5265123	4225989	-1596.072144	4103.038086	-6025.258301];
RV3=[-2516404.25	5516398.5	3831292.75	-1389.479126	3746.067871	-6304.445313];
RV4=[-2598660.75	5744241.5	3419616.25	-1180.483765	3370.848633	-6555.782715];
RV5=[-2667468.5	5947509.5	2992784.5	-969.5012207	2978.404297	-6778.28418];
%RV6=[935521.875 6047863 3749821.75 886.4678345 3821.952881 -6343.265625];
%% 
% 做轨道插值
k1=[RV2-RV1]/(64*1000);%线性插值每毫秒的轨道变化率
k2=[RV3-RV2]/(64*1000);
k3=[RV4-RV3]/(64*1000);
k4=[RV5-RV4]/(64*1000);
RV1_=RV1-k1*2750;%星上时间，TMZ148整秒值比星上时少一秒，所以在星上时上少了1750ms
RV2_=RV2-k1*2750;
RV3_=RV3-k2*2750;
RV4_=RV4-k3*2750;
RV5_=RV5-k4*2750;
%RV6_=RV6-k5*3750;
%data1=[RV1_;RV2_;RV3_;RV4_;RV5_];
data1=[RV1;RV2;RV3;RV4;RV5];
% 输入卫星姿态角
alphax1=0.00039444; alphay1=0.00126359;alphaz1=142.3512726;
alphax2=0.00194351; alphay2=-0.00838918;alphaz2=0.00004648;
alphax3=0.00158081;alphay3=-0.00358073;alphaz3=-0.00190648;
alphax4=-0.0007188;alphay4=-0.00097842;alphaz4=0.00069321;
alphax5=-0.00626822;alphay5=0.00233422;alphaz5=-0.00046371;
%alphax6=-0.0001429;alphay6=0.00107234;alphaz6=0.00011104;
ALPHAX=[alphax1; alphax2;alphax3;alphax4;alphax5]*pi/180;
ALPHAY=[alphay1; alphay2;alphay3;alphay4;alphay5]*pi/180;
ALPHAZ=[alphaz1; alphaz2;alphaz3;alphaz4;alphaz5]*pi/180;
%根据姿态角算四元数
Q1=zeros(5,4);
Q2=zeros(5,4);
Q3=zeros(5,4);
Q1_STEP=zeros(5,4);
Q2_STEP=zeros(5,4);
for i=1:5
    Q1(i,:)=[sin(ALPHAX(i)/2) 0 0 cos(ALPHAX(i)/2)];
    Q2(i,:)=[0 sin(ALPHAY(i)/2) 0 cos(ALPHAY(i)/2)];
    Q3(i,:)=[0 0 sin(ALPHAZ(i)/2) cos(ALPHAZ(i)/2)];
    [Q1_STEP(i,:)]=siyuanshuchengfa(Q3(i,:),Q1(i,:));
    [Q2_STEP(i,:)]=siyuanshuchengfa(Q1_STEP(i,:),Q2(i,:));
end
%disp(Q2_STEP);
%已算出6个时刻的姿态四元数Q2_STEP
%根据时间外推到整秒的四元数,首先输入角速度
W_1=[-0.00101268	-0.00146502	0.04906683];
W_2=[-0.00081826	0.00154286	0.00097233];
W_3=[0.00037989	0.00042353	0.00073021];
W_4=[0.00020781	-0.00052356	0.00062723];
W_5=[0.00034611	0.00067633	0.00052738];
%W_6=[-0.0014997,0.00003619,0.0010863];
W=zeros(5,3);
Q=zeros(5,4);
W=[W_1;W_2;W_3;W_4;W_5];
for i=1:5
    Q(i,:)=OutExtra(Q2_STEP(i,:),W(i,:),-1.85);
end
theta=[52.29000092;
44.93999863;
38.38999939;
40.11000061;
47.70999908;
];
phi=[330.0700073;
314.3800049;
285.4400024;
249.5500031;
225.8099976;
];
d_=[];
for i=1:5
    [d]=RV2RTP_84(theta(i),phi(i),data1(i,:),Q(i,:));
    d_=[d_;d];
end
d_=reshape(d_,3,5);
d_=d_';
for i=1:4
    a(i,:)=data1(i+1,1:3)-USER_POS;
    a_(i,:)=-a(i,:)/norm(a(i,:));
end
for i=1:4
    dot_ab=dot(d_(i+1,:),a_(i,:));
    angle(i)=acosd(dot_ab/norm(d_(i+1,:)*norm(a_(i,:))));
end
angle=angle';