% -------------------------------------------------------------------
% 功能简述：
% 根据姿态四元数积分初值与角速度，积分计算姿态四元数。
% 输入：
%   姿态四元数初值 p
%   姿态角速度ω
%   积分时间 delta t
% 输出：
%   姿态四元数 q
%--------------------------------------------------------------------
function [Q]=OutExtra(p,W,delt)
    format long;
    % 根据总体给出的外推文档V0.2 编写
%%输入卫星姿态，轨道坐标系，q1 q2 q3 q4 第一个为标量，其他为矢量    
    modW=sqrt(W(1).^2 + W(2).^2 + W(3).^2);  % 注意原始数据以deg为单位
    theta=modW*delt*pi/180;  %转换为弧度单位 reg
    q1=(W(1)/modW)*sin(theta/2);
    q2=(W(2)/modW)*sin(theta/2);
    q3=(W(3)/modW)*sin(theta/2);
    q4=cos(theta/2);
    q=[q1 q2 q3 q4]';
    p1=p(1);p2=p(2);p3=p(3);p4=p(4);
 
    M=[p4 -p3 p2 p1;p3 p4 -p1 p2;-p2 p1 p4 p3;-p1 -p2 -p3 p4];
    Q=M*q;
    modQ=sqrt(Q(1).^2 + Q(2).^2 + Q(3).^2+ Q(4).^2);
    Q=[Q(1)/modQ Q(2)/modQ Q(3)/modQ Q(4)/modQ];
 
    if Q(4)<0
        Q=-Q;
    end
 end

